app/views/bookmarks/index.html.erb

    <td></td><td></td><td></td><td></td><td></td>
    <td><%= link_to "#{bookmark.users.count}","/display/#{bookmark.id}" %></td>
---
SELECT "users".* FROM "users" INNER JOIN "user_bookmarks" ON "users".id = "user_bookmarks".user_id WHERE (("user_bookmarks".bookmark_id = 15))
SELECT COUNT(*) FROM "users" INNER JOIN "user_bookmarks" ON "users".id = "user_bookmarks".user_id WHERE (("user_bookmarks".bookmark_id = 15))