app/controllers/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = 1 LIMIT 1
---
  def show
    @bookmark = Bookmark.find(params[:id])

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = 1 LIMIT 1
---
  def edit
    @bookmark = Bookmark.find(params[:id])

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = 3 LIMIT 1
---
  def display
    #user = current_user
    #@bookmarks = user.bookmarks
    @bookmark = Bookmark.find(params[:id])

INSERT INTO "bookmarks" ("URL", "Name", "created_at", "updated_at", "date_saved", "UserMade") VALUES ('www.pogo.com', 'Games!', '2011-12-03 10:32:28.343951', '2011-12-03 10:32:28.343951', '2011-12-03 10:29:00.000000', 'sugarbear')
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."URL" = 'www.games.com' LIMIT 1
---
  def create
    bookmark = Bookmark.find_or_create_by_URL(params[:bookmark][:URL])

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = 1 LIMIT 1
UPDATE "bookmarks" SET "URL" = 'http://facebook.com', "Name" = 'Facebook', "updated_at" = '2011-11-01 19:21:13.962855' WHERE "bookmarks"."id" = 5
---
  def update

    @bookmark = Bookmark.find(params[:id])

    respond_to do |format|
      if @bookmark.UserMade == current_user.username && @bookmark.update_attributes(params[:bookmark])

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 11 LIMIT 1
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = 1
---
  def destroy
    @bookmark = Bookmark.find(params[:id])
    @user = User.find(session[:user_id])
    @user.bookmarks.delete(@bookmark)