app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def upload_avatar
    if session[:user_id]
      p params
      @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password", "email", "real_name", "encrypted_password", "salt", "avatar", "photo_file_name", "cover_image_uid", "photo_content_type", "photo_file_size") VALUES ('2011-12-21 23:57:49.022554', '2011-12-21 23:57:49.022554', 'nameless', NULL, 'name@yahoo.com', 'some name', '93ce612b7771de40d0846fddee4a8a2dfe646341684bf5f78352c7259dcea12d', 'c03dda2b87d70d130fb9f7bd805ee0abc9cb90653e656549470373f9741b55ab', NULL, NULL, NULL, NULL, NULL)

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
UPDATE "users" SET "username" = 'New Name', "email" = 'user@example.org', "salt" = 'f7b02723aa75169078092508604ef2ad01bdf9dfeb7a121ebe96216363ac9b02', "encrypted_password" = '404df63e43498b68160f9b827f54f67852422e80815524893e8f1f5b34c748b9', "updated_at" = '2011-12-03 01:12:33.712997' WHERE "users"."id" = 1